app/controllers/api/v1/lists_controller.rb

INSERT INTO "lists" ("name", "user_id", "created_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "New List Test"], ["user_id", 4], ["created_at", "2020-07-30 08:31:24.131481"]]
---
  def create
    list = List.create(name: params[:name], user_id: params[:user_id])