app/controllers/api/v1/tasks_controller.rb

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 35]]
---
  def indexList
    @tasks = List.find(params[:list_id]).tasks

INSERT INTO "tasks" ("text", "is_completed", "list_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "mow lawn"], ["is_completed", "f"], ["list_id", 22], ["created_at", "2020-07-31 04:39:15.726250"], ["updated_at", "2020-07-31 04:39:15.726250"]]
---
    task = Task.create(text: params[:text], list_id: params[:list_id], is_completed: params[:is_completed])

SELECT  "lists".* FROM "lists" WHERE "lists"."id" = $1 LIMIT $2  [["id", 35], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = $1  [["list_id", 35]]
---
  def change
    @tasks = List.find(params[:list_id]).tasks